"use strict";
//1.Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
for (let i = 20; i <= 30; i += 0.5) {
console.log(i);
}

//2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
for (let i = 10; i <= 100; i += 10) {
console.log(27 * i);
}

//3.Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let n = prompt("Введите число");
for (let i = 1; i <= 100; i++) {
if (i * i <= n) {
console.log(i);
}



  nextPrime:
  for (let i = 2; i <= n; i++) { // Для всех i...

    for (let j = 2; j < i; j++) { // проверить, делится ли число..
      if (i % j == 0) continue nextPrime; // не подходит, берём следующее
    }
  
    alert(i); // простое число
  }